UniSwarm/uDevkit-SDK/support/driver/dma/dma_dspic33a_pic32a.c
/**
 * @file dma_dspic33a_pic32a.c
 * @author Sebastien CAUX (sebcaux)
 * @copyright UniSwarm 2026
 *
 * @date September 14, 2026, 09:06 PM
 *
 * @brief DMA support driver for dsPIC33A and PIC32A
 *
 * Implementation based on Microchip documents DS70005539C, DS70005629C, DS70005591D and DS70005592A:
 *  https://ww1.microchip.com/downloads/aemDocuments/documents/MCU16/ProductDocuments/DataSheets/dsPIC33AK128MC106-Family-Data-Sheet-DS70005539.pdf
 *  https://ww1.microchip.com/downloads/aemDocuments/documents/MCU16/ProductDocuments/DataSheets/dsPIC33AK256MPS306-Family-Data-Sheet-DS70005629.pdf
 *  https://ww1.microchip.com/downloads/aemDocuments/documents/MCU16/ProductDocuments/DataSheets/dsPIC33AK512MPS512-Family-Data-Sheet-DS70005591.pdf
 *  https://ww1.microchip.com/downloads/aemDocuments/documents/MCU16/ProductDocuments/DataSheets/PIC32AK1216GC41064-Family-Data-Sheet-DS70005592.pdf
 */

#include "dma.h"

#include <archi.h>

enum
{
    DMA_FLAG_UNUSED = 0x00
};
typedef struct
{
    union
    {
        struct
        {
            unsigned used : 1;
            unsigned enabled : 1;
            unsigned : 6;
        };
        uint8_t val;
    };
} dma_status;

struct dma_dev
{
    dma_status flags;
    void (*handler)(void);
};

#ifdef UDEVKIT_HAVE_CONFIG
#    include "udevkit_config.h"
#endif

#if (DMA_COUNT >= 1) && !defined(DMA1_DISABLE)
void __attribute__((interrupt, auto_psv, weak)) _DMA0Interrupt(void);
#endif
#if (DMA_COUNT >= 2) && !defined(DMA2_DISABLE)
void __attribute__((interrupt, auto_psv, weak)) _DMA1Interrupt(void);
#endif
#if (DMA_COUNT >= 3) && !defined(DMA3_DISABLE)
void __attribute__((interrupt, auto_psv, weak)) _DMA2Interrupt(void);
#endif
#if (DMA_COUNT >= 4) && !defined(DMA4_DISABLE)
void __attribute__((interrupt, auto_psv, weak)) _DMA3Interrupt(void);
#endif
#if (DMA_COUNT >= 5) && !defined(DMA5_DISABLE)
void __attribute__((interrupt, auto_psv, weak)) _DMA4Interrupt(void);
#endif
#if (DMA_COUNT >= 6) && !defined(DMA6_DISABLE)
void __attribute__((interrupt, auto_psv, weak)) _DMA5Interrupt(void);
#endif
#if (DMA_COUNT >= 7) && !defined(DMA7_DISABLE)
void __attribute__((interrupt, auto_psv, weak)) _DMA6Interrupt(void);
#endif
#if (DMA_COUNT >= 8) && !defined(DMA8_DISABLE)
void __attribute__((interrupt, auto_psv, weak)) _DMA7Interrupt(void);
#endif

static struct dma_dev _dmas[] = {
#if DMA_COUNT >= 1
    {.flags = {{.val = DMA_FLAG_UNUSED}}, .handler = NULL},
#endif
#if DMA_COUNT >= 2
    {.flags = {{.val = DMA_FLAG_UNUSED}}, .handler = NULL},
#endif
#if DMA_COUNT >= 3
    {.flags = {{.val = DMA_FLAG_UNUSED}}, .handler = NULL},
#endif
#if DMA_COUNT >= 4
    {.flags = {{.val = DMA_FLAG_UNUSED}}, .handler = NULL},
#endif
#if DMA_COUNT >= 5
    {.flags = {{.val = DMA_FLAG_UNUSED}}, .handler = NULL},
#endif
#if DMA_COUNT >= 6
    {.flags = {{.val = DMA_FLAG_UNUSED}}, .handler = NULL},
#endif
#if DMA_COUNT >= 7
    {.flags = {{.val = DMA_FLAG_UNUSED}}, .handler = NULL},
#endif
#if DMA_COUNT >= 8
    {.flags = {{.val = DMA_FLAG_UNUSED}}, .handler = NULL},
#endif
};

void dma_init(const void *addrLow, const void *addrHigh)
{
    DMACONbits.ON = 1;
    DMACONbits.PRIORITY = 1;  // Round-robin scheme
    // DMACONbits.PRIORITY = 0; // Fixed priority scheme
    DMALOW = (uint32_t)addrLow;
    DMAHIGH = (uint32_t)addrHigh;
}

/**
 * @brief Gives a free dma device number
 * @return dma device number
 */
rt_dev_t dma_getFreeDevice(void)
{
#if DMA_COUNT >= 1
    uint8_t i;
    rt_dev_t device;

    for (i = 0; i < DMA_COUNT; i++)
    {
        if (_dmas[i].flags.used == 0)
        {
            break;
        }
    }

    if (i == DMA_COUNT)
    {
        return NULLDEV;
    }
    device = MKDEV(DEV_CLASS_DMA, i);

    dma_open(device);

    return device;
#else
    return NULLDEV;
#endif
}

/**
 * @brief Open a dma
 * @param device dma device number
 */
int dma_open(rt_dev_t device)
{
#if DMA_COUNT >= 1
    uint8_t dma = MINOR(device);
    if (dma >= DMA_COUNT)
    {
        return -1;
    }
    if (_dmas[dma].flags.used == 1)
    {
        return -1;
    }

    _dmas[dma].flags.used = 1;
    _dmas[dma].handler = NULL;

    return 0;
#else
    return -1;
#endif
}

/**
 * @brief Close a dma
 * @param device dma device number
 */
int dma_close(rt_dev_t device)
{
#if DMA_COUNT >= 1
    uint8_t dma = MINOR(device);
    if (dma >= DMA_COUNT)
    {
        return -1;
    }

    dma_disable(device);

    _dmas[dma].flags.val = DMA_FLAG_UNUSED;

    return 0;
#else
    return -1;
#endif
}

/**
 * @brief DMA sdk state
 * @param device dma device number
 * @return true if dma was openned by dma_open function
 */
bool dma_isOpened(rt_dev_t device)
{
    uint8_t dma = MINOR(device);
    if (dma >= DMA_COUNT)
    {
        return -1;
    }

    return (_dmas[dma].flags.used == 1);
}

/**
 * @brief Enable the specified dma device
 * @param device dma device number
 * @return 0 if ok, -1 in case of error
 */
int dma_enable(rt_dev_t device)
{
#if DMA_COUNT >= 1
    uint8_t dma = MINOR(device);
    if (dma >= DMA_COUNT)
    {
        return -1;
    }

    _dmas[dma].flags.enabled = 1;

    switch (dma)
    {
#    if (DMA_COUNT >= 1) && !defined(DMA1_DISABLE)
        case DMA1_ID:
            _DMA0IF = 0;
            _DMA0IE = (_dmas[dma].handler != NULL) ? 1 : 0;
            _DMA0IP = 4;
            DMA0CHbits.CHEN = 1;  // enable dma module
            break;
#    endif
#    if (DMA_COUNT >= 2) && !defined(DMA2_DISABLE)
        case DMA2_ID:
            _DMA1IF = 0;
            _DMA1IE = (_dmas[dma].handler != NULL) ? 1 : 0;
            _DMA1IP = 4;
            DMA1CHbits.CHEN = 1;  // enable dma module
            break;
#    endif
#    if (DMA_COUNT >= 3) && !defined(DMA3_DISABLE)
        case DMA3_ID:
            _DMA2IF = 0;
            _DMA2IE = (_dmas[dma].handler != NULL) ? 1 : 0;
            _DMA2IP = 4;
            DMA2CHbits.CHEN = 1;  // enable dma module
            break;
#    endif
#    if (DMA_COUNT >= 4) && !defined(DMA4_DISABLE)
        case DMA4_ID:
            _DMA3IF = 0;
            _DMA3IE = (_dmas[dma].handler != NULL) ? 1 : 0;
            _DMA3IP = 4;
            DMA3CHbits.CHEN = 1;  // enable dma module
            break;
#    endif
#    if (DMA_COUNT >= 5) && !defined(DMA5_DISABLE)
        case DMA5_ID:
            _DMA4IF = 0;
            _DMA4IE = (_dmas[dma].handler != NULL) ? 1 : 0;
            _DMA4IP = 4;
            DMA4CHbits.CHEN = 1;  // enable dma module
            break;
#    endif
#    if (DMA_COUNT >= 6) && !defined(DMA6_DISABLE)
        case DMA6_ID:
            _DMA5IF = 0;
            _DMA5IE = (_dmas[dma].handler != NULL) ? 1 : 0;
            _DMA5IP = 4;
            DMA5CHbits.CHEN = 1;  // enable dma module
            break;
#    endif
#    if (DMA_COUNT >= 7) && !defined(DMA7_DISABLE)
        case DMA7_ID:
            _DMA6IF = 0;
            _DMA6IE = (_dmas[dma].handler != NULL) ? 1 : 0;
            _DMA6IP = 4;
            DMA6CHbits.CHEN = 1;  // enable dma module
            break;
#    endif
#    if (DMA_COUNT >= 8) && !defined(DMA8_DISABLE)
        case DMA8_ID:
            _DMA7IF = 0;
            _DMA7IE = (_dmas[dma].handler != NULL) ? 1 : 0;
            _DMA7IP = 4;
            DMA7CHbits.CHEN = 1;  // enable dma module
            break;
#    endif
    }

