UniSwarm/uDevkit-SDK/support/driver/dma/dma_dspic33a_pic32a.c
    return 0;
#else
    return -1;
#endif
}

/**
 * @brief Disable the specified dma device
 * @param device dma device number
 * @return 0 if ok, -1 in case of error
 */
int dma_disable(rt_dev_t device)
{
#if DMA_COUNT >= 1
    uint8_t dma = MINOR(device);
    if (dma >= DMA_COUNT)
    {
        return -1;
    }

    _dmas[dma].flags.enabled = 0;

    switch (dma)
    {
#    if (DMA_COUNT >= 1) && !defined(DMA1_DISABLE)
        case DMA1_ID:
            _DMA0IE = 0;
            DMA0CHbits.CHEN = 0;  // disable dma module
            break;
#    endif
#    if (DMA_COUNT >= 2) && !defined(DMA2_DISABLE)
        case DMA2_ID:
            _DMA1IE = 0;
            DMA1CHbits.CHEN = 0;  // disable dma module
            break;
#    endif
#    if (DMA_COUNT >= 3) && !defined(DMA3_DISABLE)
        case DMA3_ID:
            _DMA2IE = 0;
            DMA2CHbits.CHEN = 0;  // disable dma module
            break;
#    endif
#    if (DMA_COUNT >= 4) && !defined(DMA4_DISABLE)
        case DMA4_ID:
            _DMA3IE = 0;
            DMA3CHbits.CHEN = 0;  // disable dma module
            break;
#    endif
#    if (DMA_COUNT >= 5) && !defined(DMA5_DISABLE)
        case DMA5_ID:
            _DMA4IE = 0;
            DMA4CHbits.CHEN = 0;  // disable dma module
            break;
#    endif
#    if (DMA_COUNT >= 6) && !defined(DMA6_DISABLE)
        case DMA6_ID:
            _DMA5IE = 0;
            DMA5CHbits.CHEN = 0;  // disable dma module
            break;
#    endif
#    if (DMA_COUNT >= 7) && !defined(DMA7_DISABLE)
        case DMA7_ID:
            _DMA6IE = 0;
            DMA6CHbits.CHEN = 0;  // disable dma module
            break;
#    endif
#    if (DMA_COUNT >= 8) && !defined(DMA8_DISABLE)
        case DMA8_ID:
            _DMA7IE = 0;
            DMA7CHbits.CHEN = 0;  // disable dma module
            break;
#    endif
    }

    return 0;
#else
    return -1;
#endif
}

/**
 * @brief DMA sdk enabled state
 * @param device dma device number
 * @return true if dma was enabled by dma_enable function
 */
bool dma_isEnabled(rt_dev_t device)
{
    uint8_t dma = MINOR(device);
    if (dma >= DMA_COUNT)
    {
        return -1;
    }

    return (_dmas[dma].flags.enabled == 1);
}

/**
 * @brief Sets the handler function that will be called on dma interrupt
 * @param device dma device number
 * @param handler void funtion pointer or null to remove the handler
 * @return 0 if ok, -1 in case of error
 */
int dma_setHandler(rt_dev_t device, void (*handler)(void))
{
#if DMA_COUNT >= 1
    uint8_t dma = MINOR(device);
    if (dma >= DMA_COUNT)
    {
        return -1;
    }

    _dmas[dma].handler = handler;
    if (_dmas[dma].flags.enabled == 1)
    {
        dma_enable(device);
    }

    return 0;
#else
    return -1;
#endif
}

int dma_setSource(rt_dev_t device, const void *srcAddr, uint8_t addrMode)
{
#if DMA_COUNT >= 1
    uint8_t dma = MINOR(device);
    if (dma >= DMA_COUNT)
    {
        return -1;
    }

    switch (dma)
    {
#    if (DMA_COUNT >= 1) && !defined(DMA1_DISABLE)
        case DMA1_ID:
            DMA0CHbits.SAMODE = addrMode;  // source mode
            DMA0SRC = (uint32_t)srcAddr;
            break;
#    endif
#    if (DMA_COUNT >= 2) && !defined(DMA2_DISABLE)
        case DMA2_ID:
            DMA1CHbits.SAMODE = addrMode;  // source mode
            DMA1SRC = (uint32_t)srcAddr;
            break;
#    endif
#    if (DMA_COUNT >= 3) && !defined(DMA3_DISABLE)
        case DMA3_ID:
            DMA2CHbits.SAMODE = addrMode;  // source mode
            DMA2SRC = (uint32_t)srcAddr;
            break;
#    endif
#    if (DMA_COUNT >= 4) && !defined(DMA4_DISABLE)
        case DMA4_ID:
            DMA3CHbits.SAMODE = addrMode;  // source mode
            DMA3SRC = (uint32_t)srcAddr;
            break;
#    endif
#    if (DMA_COUNT >= 5) && !defined(DMA5_DISABLE)
        case DMA5_ID:
            DMA4CHbits.SAMODE = addrMode;  // source mode
            DMA4SRC = (uint32_t)srcAddr;
            break;
#    endif
#    if (DMA_COUNT >= 6) && !defined(DMA6_DISABLE)
        case DMA6_ID:
            DMA5CHbits.SAMODE = addrMode;  // source mode
            DMA5SRC = (uint32_t)srcAddr;
            break;
#    endif
#    if (DMA_COUNT >= 7) && !defined(DMA7_DISABLE)
        case DMA7_ID:
            DMA6CHbits.SAMODE = addrMode;  // source mode
            DMA6SRC = (uint32_t)srcAddr;
            break;
#    endif
#    if (DMA_COUNT >= 8) && !defined(DMA8_DISABLE)
        case DMA8_ID:
            DMA7CHbits.SAMODE = addrMode;  // source mode
            DMA7SRC = (uint32_t)srcAddr;
            break;
#    endif
    }

    return 0;
#else
    return -1;
#endif
}

int dma_setDestination(rt_dev_t device, void *dstAddr, uint8_t addrMode)
{
#if DMA_COUNT >= 1
    uint8_t dma = MINOR(device);
    if (dma >= DMA_COUNT)
    {
        return -1;
    }

    switch (dma)
    {
#    if (DMA_COUNT >= 1) && !defined(DMA1_DISABLE)
        case DMA1_ID:
            DMA0CHbits.DAMODE = addrMode;  // destination mode
            DMA0DST = (uint32_t)dstAddr;
            break;
#    endif
#    if (DMA_COUNT >= 2) && !defined(DMA2_DISABLE)
        case DMA2_ID:
            DMA1CHbits.DAMODE = addrMode;  // destination mode
            DMA1DST = (uint32_t)dstAddr;
            break;
#    endif
#    if (DMA_COUNT >= 3) && !defined(DMA3_DISABLE)
        case DMA3_ID:
            DMA2CHbits.DAMODE = addrMode;  // destination mode
            DMA2DST = (uint32_t)dstAddr;
            break;
#    endif
#    if (DMA_COUNT >= 4) && !defined(DMA4_DISABLE)
        case DMA4_ID:
            DMA3CHbits.DAMODE = addrMode;  // destination mode
            DMA3DST = (uint32_t)dstAddr;
            break;
#    endif
#    if (DMA_COUNT >= 5) && !defined(DMA5_DISABLE)
        case DMA5_ID:
            DMA4CHbits.DAMODE = addrMode;  // destination mode
            DMA4DST = (uint32_t)dstAddr;
            break;
#    endif
#    if (DMA_COUNT >= 6) && !defined(DMA6_DISABLE)
        case DMA6_ID:
            DMA5CHbits.DAMODE = addrMode;  // destination mode
            DMA5DST = (uint32_t)dstAddr;
            break;
#    endif
#    if (DMA_COUNT >= 7) && !defined(DMA7_DISABLE)
        case DMA7_ID:
            DMA6CHbits.DAMODE = addrMode;  // destination mode
            DMA6DST = (uint32_t)dstAddr;
            break;
#    endif
#    if (DMA_COUNT >= 8) && !defined(DMA8_DISABLE)
        case DMA8_ID:
            DMA7CHbits.DAMODE = addrMode;  // destination mode
            DMA7DST = (uint32_t)dstAddr;
            break;
#    endif
    }

