UniSwarm/uDevkit-SDK/support/driver/dma/dma_dspic33a_pic32a.c
    return 0;
#else
    return -1;
#endif
}

int dma_setTrigger(rt_dev_t device, uint8_t trigger)
{
#if DMA_COUNT >= 1
    uint8_t dma = MINOR(device);
    if (dma >= DMA_COUNT)
    {
        return -1;
    }

    switch (dma)
    {
#    if (DMA_COUNT >= 1) && !defined(DMA1_DISABLE)
        case DMA1_ID:
            DMA0SELbits.CHSEL = trigger;
            break;
#    endif
#    if (DMA_COUNT >= 2) && !defined(DMA2_DISABLE)
        case DMA2_ID:
            DMA1SELbits.CHSEL = trigger;
            break;
#    endif
#    if (DMA_COUNT >= 3) && !defined(DMA3_DISABLE)
        case DMA3_ID:
            DMA2SELbits.CHSEL = trigger;
            break;
#    endif
#    if (DMA_COUNT >= 4) && !defined(DMA4_DISABLE)
        case DMA4_ID:
            DMA3SELbits.CHSEL = trigger;
            break;
#    endif
#    if (DMA_COUNT >= 5) && !defined(DMA5_DISABLE)
        case DMA5_ID:
            DMA4SELbits.CHSEL = trigger;
            break;
#    endif
#    if (DMA_COUNT >= 6) && !defined(DMA6_DISABLE)
        case DMA6_ID:
            DMA5SELbits.CHSEL = trigger;
            break;
#    endif
#    if (DMA_COUNT >= 7) && !defined(DMA7_DISABLE)
        case DMA7_ID:
            DMA6SELbits.CHSEL = trigger;
            break;
#    endif
#    if (DMA_COUNT >= 8) && !defined(DMA8_DISABLE)
        case DMA8_ID:
            DMA7SELbits.CHSEL = trigger;
            break;
#    endif
    }

    return 0;
#else
    return -1;
#endif
}

int dma_setTransferMode(rt_dev_t device, uint8_t transferMode)
{
#if DMA_COUNT >= 1
    uint8_t dma = MINOR(device);
    if (dma >= DMA_COUNT)
    {
        return -1;
    }

    switch (dma)
    {
#    if (DMA_COUNT >= 1) && !defined(DMA1_DISABLE)
        case DMA1_ID:
            DMA0CHbits.TRMODE = transferMode;
            break;
#    endif
#    if (DMA_COUNT >= 2) && !defined(DMA2_DISABLE)
        case DMA2_ID:
            DMA1CHbits.TRMODE = transferMode;
            break;
#    endif
#    if (DMA_COUNT >= 3) && !defined(DMA3_DISABLE)
        case DMA3_ID:
            DMA2CHbits.TRMODE = transferMode;
            break;
#    endif
#    if (DMA_COUNT >= 4) && !defined(DMA4_DISABLE)
        case DMA4_ID:
            DMA3CHbits.TRMODE = transferMode;
            break;
#    endif
#    if (DMA_COUNT >= 5) && !defined(DMA5_DISABLE)
        case DMA5_ID:
            DMA4CHbits.TRMODE = transferMode;
            break;
#    endif
#    if (DMA_COUNT >= 6) && !defined(DMA6_DISABLE)
        case DMA6_ID:
            DMA5CHbits.TRMODE = transferMode;
            break;
#    endif
#    if (DMA_COUNT >= 7) && !defined(DMA7_DISABLE)
        case DMA7_ID:
            DMA6CHbits.TRMODE = transferMode;
            break;
#    endif
#    if (DMA_COUNT >= 8) && !defined(DMA8_DISABLE)
        case DMA8_ID:
            DMA7CHbits.TRMODE = transferMode;
            break;
#    endif
    }

    return 0;
#else
    return -1;
#endif
}

int dma_setTransferCount(rt_dev_t device, uint16_t transferCount)
{
#if DMA_COUNT >= 1
    uint8_t dma = MINOR(device);
    if (dma >= DMA_COUNT)
    {
        return -1;
    }

    switch (dma)
    {
#    if (DMA_COUNT >= 1) && !defined(DMA1_DISABLE)
        case DMA1_ID:
            DMA0CNT = transferCount;
            break;
#    endif
#    if (DMA_COUNT >= 2) && !defined(DMA2_DISABLE)
        case DMA2_ID:
            DMA1CNT = transferCount;
            break;
#    endif
#    if (DMA_COUNT >= 3) && !defined(DMA3_DISABLE)
        case DMA3_ID:
            DMA2CNT = transferCount;
            break;
#    endif
#    if (DMA_COUNT >= 4) && !defined(DMA4_DISABLE)
        case DMA4_ID:
            DMA3CNT = transferCount;
            break;
#    endif
#    if (DMA_COUNT >= 5) && !defined(DMA5_DISABLE)
        case DMA5_ID:
            DMA4CNT = transferCount;
            break;
#    endif
#    if (DMA_COUNT >= 6) && !defined(DMA6_DISABLE)
        case DMA6_ID:
            DMA5CNT = transferCount;
            break;
#    endif
#    if (DMA_COUNT >= 7) && !defined(DMA7_DISABLE)
        case DMA7_ID:
            DMA6CNT = transferCount;
            break;
#    endif
#    if (DMA_COUNT >= 8) && !defined(DMA8_DISABLE)
        case DMA8_ID:
            DMA7CNT = transferCount;
            break;
#    endif
    }

    return 0;
#else
    return -1;
#endif
}

int dma_setWordSize(rt_dev_t device, uint8_t wordSize)
{
#if DMA_COUNT >= 1
    uint8_t dma = MINOR(device);
    if (dma >= DMA_COUNT)
    {
        return -1;
    }

    switch (dma)
    {
#    if (DMA_COUNT >= 1) && !defined(DMA1_DISABLE)
        case DMA1_ID:
            DMA0CHbits.SIZE = wordSize;
            break;
#    endif
#    if (DMA_COUNT >= 2) && !defined(DMA2_DISABLE)
        case DMA2_ID:
            DMA1CHbits.SIZE = wordSize;
            break;
#    endif
#    if (DMA_COUNT >= 3) && !defined(DMA3_DISABLE)
        case DMA3_ID:
            DMA2CHbits.SIZE = wordSize;
            break;
#    endif
#    if (DMA_COUNT >= 4) && !defined(DMA4_DISABLE)
        case DMA4_ID:
            DMA3CHbits.SIZE = wordSize;
            break;
#    endif
#    if (DMA_COUNT >= 5) && !defined(DMA5_DISABLE)
        case DMA5_ID:
            DMA4CHbits.SIZE = wordSize;
            break;
#    endif
#    if (DMA_COUNT >= 6) && !defined(DMA6_DISABLE)
        case DMA6_ID:
            DMA5CHbits.SIZE = wordSize;
            break;
#    endif
#    if (DMA_COUNT >= 7) && !defined(DMA7_DISABLE)
        case DMA7_ID:
            DMA6CHbits.SIZE = wordSize;
            break;
#    endif
#    if (DMA_COUNT >= 8) && !defined(DMA8_DISABLE)
        case DMA8_ID:
            DMA7CHbits.SIZE = wordSize;
            break;
#    endif
    }

    return 0;
#else
    return -1;
#endif
}

int dma_setOptions(rt_dev_t device, uint8_t options)
{
#if DMA_COUNT >= 1
    uint8_t dma = MINOR(device);
    if (dma >= DMA_COUNT)
    {
        return -1;
    }
    uint8_t reload = ((options & DMA_OPTION_RELOAD) == DMA_OPTION_RELOAD) ? 1 : 0;
    uint8_t nullw = ((options & DMA_OPTION_NULLW) == DMA_OPTION_NULLW) ? 0b01 : 0b00;
    switch (dma)
    {
#    if (DMA_COUNT >= 1) && !defined(DMA1_DISABLE)
        case DMA1_ID:
            DMA0CHbits.RELOADC = reload;  // RELOAD count on next operation
            DMA0CHbits.RELOADD = reload;  // RELOAD destination on next operation
            DMA0CHbits.RELOADS = reload;  // RELOAD source on next operation
            DMA0CHbits.FLWCON = nullw;     // dummy write is initiated
            break;
#    endif
#    if (DMA_COUNT >= 2) && !defined(DMA2_DISABLE)
        case DMA2_ID:
            DMA1CHbits.RELOADC = reload;  // RELOAD count on next operation
            DMA1CHbits.RELOADD = reload;  // RELOAD destination on next operation
            DMA1CHbits.RELOADS = reload;  // RELOAD source on next operation
            DMA1CHbits.FLWCON = nullw;     // dummy write is initiated
            break;
#    endif
#    if (DMA_COUNT >= 3) && !defined(DMA3_DISABLE)
        case DMA3_ID:
            DMA2CHbits.RELOADC = reload;  // RELOAD count on next operation
            DMA2CHbits.RELOADD = reload;  // RELOAD destination on next operation
            DMA2CHbits.RELOADS = reload;  // RELOAD source on next operation
            DMA2CHbits.FLWCON = nullw;     // dummy write is initiated
            break;
#    endif
#    if (DMA_COUNT >= 4) && !defined(DMA4_DISABLE)
        case DMA4_ID:
            DMA3CHbits.RELOADC = reload;  // RELOAD count on next operation
            DMA3CHbits.RELOADD = reload;  // RELOAD destination on next operation
            DMA3CHbits.RELOADS = reload;  // RELOAD source on next operation
            DMA3CHbits.FLWCON = nullw;     // dummy write is initiated
            break;
#    endif
#    if (DMA_COUNT >= 5) && !defined(DMA5_DISABLE)
        case DMA5_ID:
            DMA4CHbits.RELOADC = reload;  // RELOAD count on next operation
            DMA4CHbits.RELOADD = reload;  // RELOAD destination on next operation
            DMA4CHbits.RELOADS = reload;  // RELOAD source on next operation
            DMA4CHbits.FLWCON = nullw;     // dummy write is initiated
            break;
#    endif
#    if (DMA_COUNT >= 6) && !defined(DMA6_DISABLE)
        case DMA6_ID:
            DMA5CHbits.RELOADC = reload;  // RELOAD count on next operation
            DMA5CHbits.RELOADD = reload;  // RELOAD destination on next operation
            DMA5CHbits.RELOADS = reload;  // RELOAD source on next operation
            DMA5CHbits.FLWCON = nullw;     // dummy write is initiated
            break;
#    endif
#    if (DMA_COUNT >= 7) && !defined(DMA7_DISABLE)
        case DMA7_ID:
            DMA6CHbits.RELOADC = reload;  // RELOAD count on next operation
            DMA6CHbits.RELOADD = reload;  // RELOAD destination on next operation
            DMA6CHbits.RELOADS = reload;  // RELOAD source on next operation
            DMA6CHbits.FLWCON = nullw;     // dummy write is initiated
            break;
#    endif
#    if (DMA_COUNT >= 8) && !defined(DMA8_DISABLE)
        case DMA8_ID:
            DMA7CHbits.RELOADC = reload;  // RELOAD count on next operation
            DMA7CHbits.RELOADD = reload;  // RELOAD destination on next operation
            DMA7CHbits.RELOADS = reload;  // RELOAD source on next operation
            DMA7CHbits.FLWCON = nullw;     // dummy write is initiated
            break;
#    endif
    }

