UniSwarm/uDevkit-SDK/support/driver/dma/dma_dspic33a_pic32a.c
    return 0;
#else
    return -1;
#endif
}

int dma_softTrigger(rt_dev_t device)
{
#if DMA_COUNT >= 1
    uint8_t dma = MINOR(device);
    if (dma >= DMA_COUNT)
    {
        return -1;
    }

    switch (dma)
    {
#    if (DMA_COUNT >= 1) && !defined(DMA1_DISABLE)
        case DMA1_ID:
            DMA0CHbits.CHREQ = 1;
            break;
#    endif
#    if (DMA_COUNT >= 2) && !defined(DMA2_DISABLE)
        case DMA2_ID:
            DMA1CHbits.CHREQ = 1;
            break;
#    endif
#    if (DMA_COUNT >= 3) && !defined(DMA3_DISABLE)
        case DMA3_ID:
            DMA2CHbits.CHREQ = 1;
            break;
#    endif
#    if (DMA_COUNT >= 4) && !defined(DMA4_DISABLE)
        case DMA4_ID:
            DMA3CHbits.CHREQ = 1;
            break;
#    endif
#    if (DMA_COUNT >= 5) && !defined(DMA5_DISABLE)
        case DMA5_ID:
            DMA4CHbits.CHREQ = 1;
            break;
#    endif
#    if (DMA_COUNT >= 6) && !defined(DMA6_DISABLE)
        case DMA6_ID:
            DMA5CHbits.CHREQ = 1;
            break;
#    endif
#    if (DMA_COUNT >= 7) && !defined(DMA7_DISABLE)
        case DMA7_ID:
            DMA6CHbits.CHREQ = 1;
            break;
#    endif
#    if (DMA_COUNT >= 8) && !defined(DMA8_DISABLE)
        case DMA8_ID:
            DMA7CHbits.CHREQ = 1;
            break;
#    endif
    }

    return 0;
#else
    return -1;
#endif
}

#if (DMA_COUNT >= 1) && !defined(DMA1_DISABLE) && !defined(DMA1_INT_DISABLE)
void __attribute__((interrupt, auto_psv, weak)) _DMA0Interrupt(void)
{
    if (_dmas[DMA1_ID].handler != NULL)
    {
        (*_dmas[DMA1_ID].handler)();
    }

    _DMA0IF = 0;
}
#endif

#if (DMA_COUNT >= 2) && !defined(DMA2_DISABLE) && !defined(DMA2_INT_DISABLE)
void __attribute__((interrupt, auto_psv, weak)) _DMA1Interrupt(void)
{
    if (_dmas[DMA2_ID].handler != NULL)
    {
        (*_dmas[DMA2_ID].handler)();
    }

    _DMA1IF = 0;
}
#endif

#if (DMA_COUNT >= 3) && !defined(DMA3_DISABLE) && !defined(DMA3_INT_DISABLE)
void __attribute__((interrupt, auto_psv, weak)) _DMA2Interrupt(void)
{
    if (_dmas[DMA3_ID].handler != NULL)
    {
        (*_dmas[DMA3_ID].handler)();
    }

    _DMA2IF = 0;
}
#endif

#if (DMA_COUNT >= 4) && !defined(DMA4_DISABLE) && !defined(DMA4_INT_DISABLE)
void __attribute__((interrupt, auto_psv, weak)) _DMA3Interrupt(void)
{
    if (_dmas[DMA4_ID].handler != NULL)
    {
        (*_dmas[DMA4_ID].handler)();
    }

    _DMA3IF = 0;
}
#endif

#if (DMA_COUNT >= 5) && !defined(DMA5_DISABLE) && !defined(DMA5_INT_DISABLE)
void __attribute__((interrupt, auto_psv, weak)) _DMA4Interrupt(void)
{
    if (_dmas[DMA5_ID].handler != NULL)
    {
        (*_dmas[DMA5_ID].handler)();
    }

    _DMA4IF = 0;
}
#endif

#if (DMA_COUNT >= 6) && !defined(DMA6_DISABLE) && !defined(DMA6_INT_DISABLE)
void __attribute__((interrupt, auto_psv, weak)) _DMA5Interrupt(void)
{
    if (_dmas[DMA6_ID].handler != NULL)
    {
        (*_dmas[DMA6_ID].handler)();
    }

    _DMA5IF = 0;
}
#endif

#if (DMA_COUNT >= 7) && !defined(DMA7_DISABLE) && !defined(DMA7_INT_DISABLE)
void __attribute__((interrupt, auto_psv, weak)) _DMA6Interrupt(void)
{
    if (_dmas[DMA7_ID].handler != NULL)
    {
        (*_dmas[DMA7_ID].handler)();
    }

    _DMA6IF = 0;
}
#endif

#if (DMA_COUNT >= 8) && !defined(DMA8_DISABLE) && !defined(DMA8_INT_DISABLE)
void __attribute__((interrupt, auto_psv, weak)) _DMA7Interrupt(void)
{
    if (_dmas[DMA8_ID].handler != NULL)
    {
        (*_dmas[DMA8_ID].handler)();
    }

    _DMA7IF = 0;
}
#endif
